# build.ys
read_verilog -pwires ./benchmarks/verilog/LED/system_ee.v
hierarchy -check -top light
proc
flatten
sim -clock clock
opt_clean -purge
write_smt2 -stdt -wires model.smt2