# build.ys
read_verilog -pwires ./verilog_benchmarks/fifo_async/oh_fifo_generic-single.v
hierarchy -check -top oh_fifo_generic
proc
flatten
async2sync
dffunmap
opt_clean -purge
write_smt2 -stdt -wires fifo_async.smt2
