# build.ys
read_verilog -pwires ./benchmarks/verilog/SPI/spi_slave.v
hierarchy -top SPISlave
proc
flatten
techmap -map +/dff2ff.v
delete SPISlave/clk
synth
write_smt2 -stdt -wires spi.smt2