# build.ys
read_verilog -pwires ./designs/TrustHub/RTD021/chacha.v \
               ./designs/TrustHub/RTD021/chacha_core.v \
               ./designs/TrustHub/RTD021/chacha_qr.v
hierarchy -check -top chacha
proc
flatten
async2sync
dffunmap
opt_clean -purge
write_smt2 -stdt -wires MULTI_TEST.txt
