# build.ys
read_verilog verilog_benchmarks/iodine-benchmarks/fpu/verilog/test_harness.v \
		verilog_benchmarks/iodine-benchmarks/fpu/verilog/pre_norm.v \
		verilog_benchmarks/iodine-benchmarks/fpu/verilog/primitives.v \
		verilog_benchmarks/iodine-benchmarks/fpu/verilog/pre_norm_fmul.v \
        verilog_benchmarks/iodine-benchmarks/fpu/verilog/except.v
hierarchy -top fdiv_harness
proc
flatten
write_smt2 -stdt -wires fpu_small.smt2