# build.ys
read_verilog -pwires ./verilog_benchmarks/infoflow.v
hierarchy -check -top main
proc
flatten
opt_clean -purge
write_smt2 -stdt -wires model.smt2
